Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pit64b.h
/**
 * \brief Component description for PIT64B
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_PIT64B_COMPONENT_H_
#define _SAM9X_PIT64B_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PIT64B                                       */
/* ************************************************************************** */

/* -------- PIT64B_CR : (PIT64B Offset: 0x00) ( /W 32) Control Register -------- */
#define PIT64B_CR_START_Pos                   _U_(0)                                               /**< (PIT64B_CR) Start Timer Position */
#define PIT64B_CR_START_Msk                   (_U_(0x1) << PIT64B_CR_START_Pos)                    /**< (PIT64B_CR) Start Timer Mask */
#define PIT64B_CR_START(value)                (PIT64B_CR_START_Msk & ((value) << PIT64B_CR_START_Pos))
#define PIT64B_CR_SWRST_Pos                   _U_(8)                                               /**< (PIT64B_CR) Software Reset Position */
#define PIT64B_CR_SWRST_Msk                   (_U_(0x1) << PIT64B_CR_SWRST_Pos)                    /**< (PIT64B_CR) Software Reset Mask */
#define PIT64B_CR_SWRST(value)                (PIT64B_CR_SWRST_Msk & ((value) << PIT64B_CR_SWRST_Pos))
#define PIT64B_CR_Msk                         _U_(0x00000101)                                      /**< (PIT64B_CR) Register Mask  */


/* -------- PIT64B_MR : (PIT64B Offset: 0x04) (R/W 32) Mode Register -------- */
#define PIT64B_MR_CONT_Pos                    _U_(0)                                               /**< (PIT64B_MR) Continuous Mode Position */
#define PIT64B_MR_CONT_Msk                    (_U_(0x1) << PIT64B_MR_CONT_Pos)                     /**< (PIT64B_MR) Continuous Mode Mask */
#define PIT64B_MR_CONT(value)                 (PIT64B_MR_CONT_Msk & ((value) << PIT64B_MR_CONT_Pos))
#define PIT64B_MR_SGCLK_Pos                   _U_(3)                                               /**< (PIT64B_MR) Generic Clock Selection Enable Position */
#define PIT64B_MR_SGCLK_Msk                   (_U_(0x1) << PIT64B_MR_SGCLK_Pos)                    /**< (PIT64B_MR) Generic Clock Selection Enable Mask */
#define PIT64B_MR_SGCLK(value)                (PIT64B_MR_SGCLK_Msk & ((value) << PIT64B_MR_SGCLK_Pos))
#define PIT64B_MR_SMOD_Pos                    _U_(4)                                               /**< (PIT64B_MR) Start Mode Position */
#define PIT64B_MR_SMOD_Msk                    (_U_(0x1) << PIT64B_MR_SMOD_Pos)                     /**< (PIT64B_MR) Start Mode Mask */
#define PIT64B_MR_SMOD(value)                 (PIT64B_MR_SMOD_Msk & ((value) << PIT64B_MR_SMOD_Pos))
#define PIT64B_MR_PRESCALER_Pos               _U_(8)                                               /**< (PIT64B_MR) Prescaler Period Position */
#define PIT64B_MR_PRESCALER_Msk               (_U_(0xF) << PIT64B_MR_PRESCALER_Pos)                /**< (PIT64B_MR) Prescaler Period Mask */
#define PIT64B_MR_PRESCALER(value)            (PIT64B_MR_PRESCALER_Msk & ((value) << PIT64B_MR_PRESCALER_Pos))
#define PIT64B_MR_Msk                         _U_(0x00000F19)                                      /**< (PIT64B_MR) Register Mask  */


/* -------- PIT64B_LSBPR : (PIT64B Offset: 0x08) (R/W 32) LSB Period Register -------- */
#define PIT64B_LSBPR_LSBPERIOD_Pos            _U_(0)                                               /**< (PIT64B_LSBPR) 32 LSB of the Timer Period Position */
#define PIT64B_LSBPR_LSBPERIOD_Msk            (_U_(0xFFFFFFFF) << PIT64B_LSBPR_LSBPERIOD_Pos)      /**< (PIT64B_LSBPR) 32 LSB of the Timer Period Mask */
#define PIT64B_LSBPR_LSBPERIOD(value)         (PIT64B_LSBPR_LSBPERIOD_Msk & ((value) << PIT64B_LSBPR_LSBPERIOD_Pos))
#define PIT64B_LSBPR_Msk                      _U_(0xFFFFFFFF)                                      /**< (PIT64B_LSBPR) Register Mask  */


/* -------- PIT64B_MSBPR : (PIT64B Offset: 0x0C) (R/W 32) MSB Period Register -------- */
#define PIT64B_MSBPR_MSBPERIOD_Pos            _U_(0)                                               /**< (PIT64B_MSBPR) 32 MSB of the Timer Period Position */
#define PIT64B_MSBPR_MSBPERIOD_Msk            (_U_(0xFFFFFFFF) << PIT64B_MSBPR_MSBPERIOD_Pos)      /**< (PIT64B_MSBPR) 32 MSB of the Timer Period Mask */
#define PIT64B_MSBPR_MSBPERIOD(value)         (PIT64B_MSBPR_MSBPERIOD_Msk & ((value) << PIT64B_MSBPR_MSBPERIOD_Pos))
#define PIT64B_MSBPR_Msk                      _U_(0xFFFFFFFF)                                      /**< (PIT64B_MSBPR) Register Mask  */


/* -------- PIT64B_IER : (PIT64B Offset: 0x10) ( /W 32) Interrupt Enable Register -------- */
#define PIT64B_IER_PERIOD_Pos                 _U_(0)                                               /**< (PIT64B_IER) Elapsed Timer Period Interrupt Enable Position */
#define PIT64B_IER_PERIOD_Msk                 (_U_(0x1) << PIT64B_IER_PERIOD_Pos)                  /**< (PIT64B_IER) Elapsed Timer Period Interrupt Enable Mask */
#define PIT64B_IER_PERIOD(value)              (PIT64B_IER_PERIOD_Msk & ((value) << PIT64B_IER_PERIOD_Pos))
#define PIT64B_IER_OVRE_Pos                   _U_(1)                                               /**< (PIT64B_IER) Overrun Error Interrupt Enable Position */
#define PIT64B_IER_OVRE_Msk                   (_U_(0x1) << PIT64B_IER_OVRE_Pos)                    /**< (PIT64B_IER) Overrun Error Interrupt Enable Mask */
#define PIT64B_IER_OVRE(value)                (PIT64B_IER_OVRE_Msk & ((value) << PIT64B_IER_OVRE_Pos))
#define PIT64B_IER_SECE_Pos                   _U_(4)                                               /**< (PIT64B_IER) Safety and/or Security Report Interrupt Enable Position */
#define PIT64B_IER_SECE_Msk                   (_U_(0x1) << PIT64B_IER_SECE_Pos)                    /**< (PIT64B_IER) Safety and/or Security Report Interrupt Enable Mask */
#define PIT64B_IER_SECE(value)                (PIT64B_IER_SECE_Msk & ((value) << PIT64B_IER_SECE_Pos))
#define PIT64B_IER_Msk                        _U_(0x00000013)                                      /**< (PIT64B_IER) Register Mask  */


